In [1]:
data = {
    "ID": range(1, 11),
    "Age": [25, 30, 35, np.nan, 45, 50, 29, 41, np.nan, 38],
    "Salary": [50000, 60000, 75000, 40000, 90000, 100000, 55000, 80000, 62000, np.nan],
    "Education": ["Bachelor", "Master", "PhD", "Bachelor", "Master", "PhD", "Bachelor", "Master", "PhD", "Bachelor"],
    "Work Experience": [2, 5, 7, 1, 10, 12, 3, 8, 6, np.nan],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio", "San Diego", "Dallas", "San Jose"]
}

df = pd.DataFrame(data)

In [2]:
df.head()

   ID   Age   Salary Education  Work Experience         City
0   1  25.0  50000.0  Bachelor              2.0     New York
1   2  30.0  60000.0    Master              5.0  Los Angeles
2   3  35.0  75000.0       PhD              7.0      Chicago
3   4   NaN  40000.0  Bachelor              1.0      Houston
4   5  45.0  90000.0    Master             10.0      Phoenix


    "1. How many missing values are there in each column?",
    "2. How can we handle missing values in 'Age' and 'Salary' columns?",
    "3. Convert the 'Education' column into numerical values using one-hot encoding.",
    "4. Normalize the 'Salary' column using Min-Max Scaling.",
    "5. Create a new feature 'Experience Level' based on 'Work Experience' (e.g., Junior, Mid, Senior).",
    "6. Encode the 'City' column using label encoding.",
    "7. Generate an interaction feature between 'Age' and 'Work Experience'.",
    "8. Apply log transformation on the 'Salary' column to reduce skewness.",
    "9. Extract the first letter of each city name and create a new feature 'City Initial'.",
    "10. What insights can be drawn from the transformed dataset?"
]